RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_efm.c
/******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_efm.c
 **
 ** A detailed description is available at
 ** @link EfmGroup EFM description @endlink
 **
 **   - 2018-10-29  CDT  First version for Device Driver Library of EFM.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_efm.h"
#include "hc32f460_utility.h"

#if (DDL_EFM_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup EfmGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define EFM_LOCK                            (0x00000000u)
#define EFM_UNLOCK                          (0x00000001u)
#define EFM_KEY1                            (0x0123ul)
#define EFM_KEY2                            (0x3210ul)

#define EFM_PROTECT_ADDR_MSK                (0x000FFFFFu)

/*  Parameter validity check for pointer. */
#define IS_VALID_POINTER(x)                 (NULL != (x))

/*  Parameter validity check for flash latency. */
#define IS_VALID_FLASH_LATENCY(x)                                              \
(   ((x) == EFM_LATENCY_0)                      ||                             \
    ((x) == EFM_LATENCY_1)                      ||                             \
    ((x) == EFM_LATENCY_2)                      ||                             \
    ((x) == EFM_LATENCY_3)                      ||                             \
    ((x) == EFM_LATENCY_4)                      ||                             \
    ((x) == EFM_LATENCY_5)                      ||                             \
    ((x) == EFM_LATENCY_6)                      ||                             \
    ((x) == EFM_LATENCY_7)                      ||                             \
    ((x) == EFM_LATENCY_8)                      ||                             \
    ((x) == EFM_LATENCY_9)                      ||                             \
    ((x) == EFM_LATENCY_10)                     ||                             \
    ((x) == EFM_LATENCY_11)                     ||                             \
    ((x) == EFM_LATENCY_12)                     ||                             \
    ((x) == EFM_LATENCY_13)                     ||                             \
    ((x) == EFM_LATENCY_14)                     ||                             \
    ((x) == EFM_LATENCY_15))

/*  Parameter validity check for read mode. */
#define IS_VALID_READ_MD(MD)                                                   \
(   ((MD) == NormalRead)                        ||                             \
    ((MD) == UltraPowerRead))

/*  Parameter validity check for erase/program mode. */
#define IS_VALID_ERASE_PGM_MD(MD)                                              \
(   ((MD) == EFM_MODE_READONLY)                ||                              \
    ((MD) == EFM_MODE_SINGLEPROGRAM)           ||                              \
    ((MD) == EFM_MODE_SINGLEPROGRAMRB)         ||                              \
    ((MD) == EFM_MODE_SEQUENCEPROGRAM)         ||                              \
    ((MD) == EFM_MODE_SECTORERASE)             ||                              \
    ((MD) == EFM_MODE_CHIPERASE))

/*  Parameter validity check for flash flag. */
#define IS_VALID_FLASH_FLAG(flag)                                              \
(   ((flag) == EFM_FLAG_WRPERR)                 ||                             \
    ((flag) == EFM_FLAG_PEPRTERR)               ||                             \
    ((flag) == EFM_FLAG_PGSZERR)                ||                             \
    ((flag) == EFM_FLAG_PGMISMTCH)              ||                             \
    ((flag) == EFM_FLAG_EOP)                    ||                             \
    ((flag) == EFM_FLAG_COLERR)                 ||                             \
    ((flag) == EFM_FLAG_RDY))

/*  Parameter validity check for flash clear flag. */
#define IS_VALID_CLEAR_FLASH_FLAG(flag)                                        \
(   ((flag) == EFM_FLAG_WRPERR)                 ||                             \
    ((flag) == EFM_FLAG_PEPRTERR)               ||                             \
    ((flag) == EFM_FLAG_PGSZERR)                ||                             \
    ((flag) == EFM_FLAG_PGMISMTCH)              ||                             \
    ((flag) == EFM_FLAG_EOP)                    ||                             \
    ((flag) == EFM_FLAG_COLERR))

/*  Parameter validity check for flash interrupt. */
#define IS_VALID_EFM_INT_SEL(int)                                              \
(   ((int) == PgmErsErrInt)                     ||                             \
    ((int) == EndPgmInt)                        ||                             \
    ((int) == ColErrInt))

/*  Parameter validity check for flash address. */
#define IS_VALID_FLASH_ADDR(addr)                                              \
(   ((addr) == 0x00000000u)                      ||                            \
    (((addr) >= 0x00000001u)                     &&                            \
    ((addr) <= 0x0007FFDFu)))

