RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_efm.c
    DDL_ASSERT(IS_VALID_FLASH_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_POINTER(pBuf));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_WRPERR | EFM_FLAG_PEPRTERR | EFM_FLAG_PGSZERR |
                  EFM_FLAG_PGMISMTCH | EFM_FLAG_EOP | EFM_FLAG_COLERR);

    /* read back CACHE */
    u8tmp = (uint8_t)M4_EFM->FRMC_f.CACHE;

    M4_EFM->FRMC_f.CACHE = Disable;

    /* Enable program. */
    EFM_ErasePgmCmd(Enable);
    /* Set sequence program mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_SEQUENCEPROGRAM;
    /* clear read collided error flag.*/
    EFM_ClearFlag(EFM_FLAG_COLERR);
    EFM_ClearFlag(EFM_FLAG_WRPERR);

    /* program data. */
    for(i = 0ul; i < u32LoopWords; i++)
    {
        *u32pDest++ = *u32pSrc++;
        /* wait operate end. */
        while(1ul != M4_EFM->FSR_f.OPTEND)
        {
            u16Timeout++;
            if(u16Timeout > 0x1000u)
            {
                enRet = ErrorTimeout;
            }
        }
        /* clear end flag. */
        EFM_ClearFlag(EFM_FLAG_EOP);
    }
    if(u32RemainBytes)
    {
        EFM_Memcpy(&u32Tmp, u32pSrc, u32RemainBytes);
        *u32pDest++ = u32Tmp;
    }

    /* Set read only mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_READONLY;

    u16Timeout = 0u;
    while(1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if(u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    EFM_ErasePgmCmd(Disable);

    /* recover CACHE */
    M4_EFM->FRMC_f.CACHE = u8tmp;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Flash sector erase.
 **
 ** \param  [in] u32Addr                The uncertain(random) address in the specified sector.
 **
 ** \retval en_result_t
 **
 ** \note   The address should be word align.
 **
 ******************************************************************************/
en_result_t EFM_SectorErase(uint32_t u32Addr)
{
    uint8_t u8tmp;
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_FLASH_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_WRPERR | EFM_FLAG_PEPRTERR | EFM_FLAG_PGSZERR |
                  EFM_FLAG_PGMISMTCH | EFM_FLAG_EOP | EFM_FLAG_COLERR);

    /* read back CACHE */
    u8tmp = (uint8_t)M4_EFM->FRMC_f.CACHE;

    M4_EFM->FRMC_f.CACHE = Disable;

    /* Enable erase. */
    EFM_ErasePgmCmd(Enable);
    /* Set sector erase mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_SECTORERASE;

    *(uint32_t*)u32Addr = 0x12345678u;

    while(1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if(u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    /* Set read only mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_READONLY;
    EFM_ErasePgmCmd(Disable);

    /* recover CACHE */
    M4_EFM->FRMC_f.CACHE = u8tmp;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Flash mass erase.
 **
 ** \param  [in] u32Addr                The uncertain(random) address in the flash.
 **
 ** \retval en_result_t
 **
 ** \note   The address should be word align.
 **
 ******************************************************************************/
en_result_t EFM_MassErase(uint32_t u32Addr)
{
    uint8_t u8tmp;
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_FLASH_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_WRPERR | EFM_FLAG_PEPRTERR | EFM_FLAG_PGSZERR |
                  EFM_FLAG_PGMISMTCH | EFM_FLAG_EOP | EFM_FLAG_COLERR);

    /* read back CACHE */
    u8tmp = (uint8_t)M4_EFM->FRMC_f.CACHE;

    M4_EFM->FRMC_f.CACHE = Disable;

    /* Enable erase. */
    EFM_ErasePgmCmd(Enable);
    /* Set sector erase mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_CHIPERASE;

    *(uint32_t*)u32Addr = 0x12345678u;

    while(1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if(u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    /* Set read only mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_READONLY;
    EFM_ErasePgmCmd(Disable);

    /* recover CACHE */
    M4_EFM->FRMC_f.CACHE = u8tmp;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Get flash switch status.
 **
 ** \param  None.
 **
 ** \retval en_flag_status_t
 ** \arg    Set             The flash has switched, the start address is sector1.
 ** \arg    Reset           The flash did not switch, the start address is sector0.
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t EFM_GetSwitchStatus(void)
{
    return ((0u == M4_EFM->FSWP_f.FSWP) ? Set : Reset);
}

/**
 *******************************************************************************
 ** \brief  Lock OTP data block.
 **
 ** \param  u32Addr                     The addr to lock.
 **
 ** \retval en_result_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t EFM_OtpLock(uint32_t u32Addr)
{
    DDL_ASSERT(IS_VALID_OTP_LOCK_ADDR(u32Addr));
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    /* Enable program. */
    EFM_ErasePgmCmd(Enable);
    /* Set single program mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_SINGLEPROGRAM;

    /* Lock the otp block. */
    *(uint32_t*)u32Addr = 0ul;

    while(1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if(u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    /* Set read only mode. */
    M4_EFM->FWMC_f.PEMOD = EFM_MODE_READONLY;
    EFM_ErasePgmCmd(Disable);

    return enRet;
}
/**
 *******************************************************************************
 ** \brief read unique ID.
 **
 ** \param None
 **
 ** \retval uint32_t
 **
 ** \note   None
 **
 ******************************************************************************/
stc_efm_unique_id_t EFM_ReadUID(void)
{
    stc_efm_unique_id_t stcUID;

    stcUID.uniqueID1 = M4_EFM->UQID1;
    stcUID.uniqueID2 = M4_EFM->UQID2;
    stcUID.uniqueID3 = M4_EFM->UQID3;

    return stcUID;
}

//@} // EfmGroup

#endif /* DDL_EFM_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
